[{"date": "11/29", "ranking": "1", "ideas": "Lectures should give more information one can use for doing homework. \"Official/elegant\" solutions to homework, posted by staff after submission deadlines, would be very useful as well."}, {"date": "11/17", "ranking": "2", "ideas": "Sometimes I get the wrong answer on the quiz questions. But other than that red X, I do not get any more feedback. It would be great if the teachers would explain each quiz question's answer in the following week, so that we can understand how we were wrong. We would still get that question wrong and points deducted, but at least we would gain understanding. Thanks."}, {"date": "10/10", "ranking": "3", "ideas": "Cloud computing can be vulnerable to malicious attacks and infrastructure failure. What are some ways to protect the cloud infrastructure from these vulnerabilities?"}, {"date": "11/22", "ranking": "4", "ideas": "I did not join this course at the same time as other students; I have begun many weeks after the course was initially offered. Links to online tutorials are helpful, but interactive guides help me most as I can learn (even by trial-and-error) best with a hands-on approach."}, {"date": "11/5", "ranking": "5", "ideas": "As a professional, I travel a lot. Would it be possible to get a zip file of all course resources without big images etc. that I could view offline on a plane or an airport?"}, {"date": "11/14", "ranking": "6", "ideas": "This course should have a stronger link to what is going on in industry. For example, a more in-depth analysis of an Amazon-style Service-oriented architecture."}, {"date": "11/1", "ranking": "7", "ideas": "Some of the lectures are a bit disorganized and tend not to stay on topic."}, {"date": "11/9", "ranking": "8", "ideas": "Web software development is tough without discussion of databases can we have links to more DB resources?"}, {"date": "11/3", "ranking": "9", "ideas": "Cucumber/rspec implementations are very complicated, please dedicate more time to this."}, {"date": "11/30", "ranking": "10", "ideas": "I'd like to learn more about SOA and \"shared-nothing\" application layer challenges."}]